const config = {

}

const missionConfig = [
    {
        "missionMap": [
            [0, 0], [0, 1], [0, 2],
            [1, 2],
            [2, 2],
            [3, 2], [3, 3], [3, 4], [3, 5],
            [4, 5],
            [5, 5], [5, 6], [5, 7], [5, 8], [5, 9]
        ],
        "enemy": {
            "count": 15,
            "life": 5,
            "speed": 2,
            "reward": 20,
        },
        "tower": {
            "attack": {
                "小炮": 1,
                "大炮": 2,
                "歼灭炮": 5,
                "毁世炮": 10,
            },
            "range": {
                "小炮": 150,
                "大炮": 200,
                "歼灭炮": 250,
                "毁世炮": 300,
            },
            "price": {
                "小炮": 20,
                "大炮": 60,
                "歼灭炮": 200,
                "毁世炮": 500,
            },
            "coolDownTime": {
                "小炮": 100,
                "大炮": 150,
                "歼灭炮": 200,
                "毁世炮": 300,
            }
        }
    },
    {
        "missionMap": [
            [0, 0], [0, 1], [0, 2], [0, 3], [0, 4],
            [1, 4],
            [2, 4],
            [3, 4], [3, 5], [3, 6], [3, 7],
            [4, 7],
            [5, 7], [5, 8], [5, 9]
        ],
        "enemy": {
            "count": 25,
            "life": 20,
            "speed": 3,
            "reward": 30
        },
        "tower": {
            "attack": {
                "小炮": 2,
                "大炮": 4,
                "歼灭炮": 5,
                "毁世炮": 10,
            },
            "range": {
                "小炮": 150,
                "大炮": 200,
                "歼灭炮": 250,
                "毁世炮": 300,
            },
            "price": {
                "小炮": 30,
                "大炮": 80,
                "歼灭炮": 300,
                "毁世炮": 600,
            },
            "coolDownTime": {
                "小炮": 100,
                "大炮": 150,
                "歼灭炮": 200,
                "毁世炮": 300,
            }
        }
    },
    {
        "missionMap": [
            [0, 0], [0, 1],
            [1, 1],
            [2, 1],
            [3, 1], [3, 2], [3, 3], [3, 4],
            [4, 4],
            [5, 4],
            [6, 4],
        ],
        "enemy": {
            "count": 35,
            "life": 30,
            "speed": 4,
            "reward": 50
        },
        "tower": {
            "attack": {
                "小炮": 5,
                "大炮": 8,
                "歼灭炮": 10,
                "毁世炮": 15,
            },
            "range": {
                "小炮": 200,
                "大炮": 250,
                "歼灭炮": 300,
                "毁世炮": 350,
            },
            "price": {
                "小炮": 50,
                "大炮": 100,
                "歼灭炮": 400,
                "毁世炮": 800,
            },
            "coolDownTime": {
                "小炮": 100,
                "大炮": 150,
                "歼灭炮": 200,
                "毁世炮": 300,
            }
        }
    }
]
